## Question:1

In [2]:
#importing libraries
import pandas as pd
import numpy as np

In [104]:
#Read the csv file
df=pd.read_csv("https://gist.githubusercontent.com/Prateek2901/9fb974729485b7a5c8f0b35fb2452cdf/raw/2831393868cecf6f65be4cb17924163ecfe3ad9c/titanic_prepared_data.csv")

In [105]:
df.head(5)

,Survived,Sex,Age,Fare,Pclass_1,Pclass_2,Pclass_3,Embarked_0,Embarked_1,Embarked_2,FamilySize
0,0,1,22.0,7.2500,0,0,1,0,0,1,2
1,1,0,38.0,71.2833,1,0,0,1,0,0,2
2,1,0,26.0,7.9250,0,0,1,0,0,1,1
3,1,0,35.0,53.1000,1,0,0,0,0,1,2
4,0,1,35.0,8.0500,0,0,1,0,0,1,1

In [106]:
df.shape

(891, 11)

In [107]:
df.size

9801

In [108]:
## this is label
X=df['Survived']

In [95]:
X[:5]

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [109]:
df=df.drop(['Survived','Embarked_1','Embarked_2','Embarked_0','FamilySize'],axis=1)

In [112]:
##this is feature
Y=df
Y.head(5)

   Sex   Age     Fare  Pclass_1  Pclass_2  Pclass_3
0    1  22.0   7.2500         0         0         1
1    0  38.0  71.2833         1         0         0
2    0  26.0   7.9250         0         0         1
3    0  35.0  53.1000         1         0         0
4    1  35.0   8.0500         0         0         1

## Question 2

In [61]:
#importing libraries and perform linear regression
from sklearn.linear_model import LinearRegression
lreg=LinearRegression()
lreg

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [62]:
labels=df['Survived']
from sklearn.cross_validation import train_test_split
# Splitting the train ans test data
x_train,x_test,y_train,y_test=train_test_split(df,labels,test_size=0.30,random_state=2)
# fittinf training dataset into model
lreg.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [63]:
#Accuracy score
lreg.score(x_test,y_test)

1.0

## Question-3

In [64]:
# read the dataset csv file
train_data=pd.read_csv("https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/train.csv")

In [5]:
train_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Removing the null values from survived column

In [66]:
train_data=train_data.dropna()

### Make new column has_cabin which tells is passenger has a cabin or not

In [67]:
g=pd.isnull(train_data)

In [68]:
has_cabin=[]
for i in g['Cabin']:
    if i==True:
         has_cabin.append(0)
    else:
        has_cabin.append(1)

In [69]:
train_data['has_cabin']=has_cabin

### Make new column title and values extract from name column of dataset

In [70]:
title=train_data['Name'].str.extract("(Mr|Master|Mrs|Miss|\w+)\\.",expand=True)

In [71]:
train_data['title']=title
b=[]
for i in train_data['title']:
    if i=='Mr':
        b.append(i)
    elif i=='Mrs':
        b.append(i)
    elif i=='Miss':
        b.append(i)
    elif i=='Master':
        b.append(i)
        
    else:
        b.append("special")

In [72]:
train_data['title']=b

In [73]:
train_data['title'][:5]

1      Mrs
3      Mrs
6       Mr
10    Miss
11    Miss
Name: title, dtype: object

### Fill the missing values with mean value. using .fillna()

In [113]:

train_data.fillna(train_data.mean())
train_data.head(5)

,Survived,Pclass,Sex,has_cabin,title,categorical_age,categorical_fare,female,male,Master,Miss,Mr,Mrs,special
1,1,1,female,1,Mrs,3,5,1,0,0,0,0,1,0
3,1,1,female,1,Mrs,3,5,1,0,0,0,0,1,0
6,0,1,male,1,Mr,5,5,0,1,0,0,1,0,0
10,1,3,female,1,Miss,1,3,1,0,0,1,0,0,0
11,1,1,female,1,Miss,5,4,1,0,0,1,0,0,0

### Create the two new column categorical_age and categorical_fare and bins age and fare variable values with numeric data using .qcut() method

In [75]:
categorical_age=pd.qcut(train_data['Age'],5,labels=[1,2,3,4,5])

In [76]:
categorical_fare=pd.qcut(df['Fare'],5,labels=[1,2,3,4,5])

In [77]:
train_data['categorical_age']=categorical_age
train_data['categorical_fare']=categorical_fare

### Drop the columns

In [78]:
train_data=train_data.drop(['Cabin','Age','Name','Fare','PassengerId','Ticket'],axis=1)
train_data=train_data.drop(['SibSp','Parch'],axis=1)
train_data.head(5)

,Survived,Pclass,Sex,Embarked,has_cabin,title,categorical_age,categorical_fare
1,1,1,female,C,1,Mrs,3,5
3,1,1,female,S,1,Mrs,3,5
6,0,1,male,S,1,Mr,5,5
10,1,3,female,S,1,Miss,1,3
11,1,1,female,S,1,Miss,5,4

In [79]:
train_data=train_data.drop(['Embarked'],axis=1)

###  Transform all variables into numeric ones using get_dummies().

In [80]:
dummy=pd.get_dummies(train_data['Sex'])
dummy1=pd.get_dummies(train_data['title'])
train_data=pd.concat([train_data,dummy],axis=1)
train_data=pd.concat([train_data,dummy1],axis=1)
train_data.head(5)

,Survived,Pclass,Sex,has_cabin,title,categorical_age,categorical_fare,female,male,Master,Miss,Mr,Mrs,special
1,1,1,female,1,Mrs,3,5,1,0,0,0,0,1,0
3,1,1,female,1,Mrs,3,5,1,0,0,0,0,1,0
6,0,1,male,1,Mr,5,5,0,1,0,0,1,0,0
10,1,3,female,1,Miss,1,3,1,0,0,1,0,0,0
11,1,1,female,1,Miss,5,4,1,0,0,1,0,0,0

### Perform logisticRegression

In [81]:
#importing logistic regression library
from sklearn.linear_model import LogisticRegression

In [82]:
reg=LogisticRegression()

In [83]:
#importing train_test_Split to split the data set into  tarining set and test set
from sklearn.cross_validation import train_test_split

In [84]:
train_data.head(5)

,Survived,Pclass,Sex,has_cabin,title,categorical_age,categorical_fare,female,male,Master,Miss,Mr,Mrs,special
1,1,1,female,1,Mrs,3,5,1,0,0,0,0,1,0
3,1,1,female,1,Mrs,3,5,1,0,0,0,0,1,0
6,0,1,male,1,Mr,5,5,0,1,0,0,1,0,0
10,1,3,female,1,Miss,1,3,1,0,0,1,0,0,0
11,1,1,female,1,Miss,5,4,1,0,0,1,0,0,0

In [85]:
train_data=train_data.dropna()

In [86]:
#As,Survived variable is a output variable
labels=train_data['Survived']

In [87]:
#Sex,Survived except these two all are featues
train=train_data.drop(['Sex','title','Survived'],axis=1)

In [91]:
# breaking dataset as train and test set
x_train,x_test,y_train,y_test=train_test_split(train,labels,test_size=0.30,random_state=2)

In [92]:
#fitting training set into model
reg.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [93]:
# accuracy score
reg.score(x_test,y_test)

0.72727272727272729